kafka-performance-tests/producer-test-2026-04-21_230337.log
1000000 records sent, 759301.4 records/sec (72.41 MB/sec), 3.57 ms avg latency, 322.00 ms max latency, 3 ms 50th, 9 ms 95th, 13 ms 99th, 18 ms 99.9th.

Metric Name                                                                                   Value
app-info:commit-id:{client-id=perf-producer-client}                                         : 13f70256db3c994c
app-info:start-time-ms:{client-id=perf-producer-client}                                     : 1776812618706
app-info:version:{client-id=perf-producer-client}                                           : 4.1.0
kafka-metrics-count:count:{client-id=perf-producer-client}                                  : 110.000
producer-metrics:batch-size-avg:{client-id=perf-producer-client}                            : 28219.061
producer-metrics:batch-size-max:{client-id=perf-producer-client}                            : 32667.000
producer-metrics:batch-split-rate:{client-id=perf-producer-client}                          : 0.000
producer-metrics:batch-split-total:{client-id=perf-producer-client}                         : 0.000
producer-metrics:buffer-available-bytes:{client-id=perf-producer-client}                    : 33554432.000
producer-metrics:buffer-exhausted-rate:{client-id=perf-producer-client}                     : 0.000
producer-metrics:buffer-exhausted-total:{client-id=perf-producer-client}                    : 0.000
producer-metrics:buffer-total-bytes:{client-id=perf-producer-client}                        : 33554432.000
producer-metrics:bufferpool-wait-ratio:{client-id=perf-producer-client}                     : 0.000
producer-metrics:bufferpool-wait-time-ns-total:{client-id=perf-producer-client}             : 0.000
producer-metrics:compression-rate-avg:{client-id=perf-producer-client}                      : 1.000
producer-metrics:connection-close-rate:{client-id=perf-producer-client}                     : 0.000
producer-metrics:connection-close-total:{client-id=perf-producer-client}                    : 0.000
producer-metrics:connection-count:{client-id=perf-producer-client}                          : 2.000
producer-metrics:connection-creation-rate:{client-id=perf-producer-client}                  : 0.064
producer-metrics:connection-creation-total:{client-id=perf-producer-client}                 : 2.000
producer-metrics:failed-authentication-rate:{client-id=perf-producer-client}                : 0.000
producer-metrics:failed-authentication-total:{client-id=perf-producer-client}               : 0.000
producer-metrics:failed-reauthentication-rate:{client-id=perf-producer-client}              : 0.000
producer-metrics:failed-reauthentication-total:{client-id=perf-producer-client}             : 0.000
producer-metrics:flush-time-ns-total:{client-id=perf-producer-client}                       : 3603457.000
producer-metrics:incoming-byte-rate:{client-id=perf-producer-client}                        : 5852.805
producer-metrics:incoming-byte-total:{client-id=perf-producer-client}                       : 182350.000
producer-metrics:io-ratio:{client-id=perf-producer-client}                                  : 0.006
producer-metrics:io-time-ns-avg:{client-id=perf-producer-client}                            : 24624.281
producer-metrics:io-time-ns-total:{client-id=perf-producer-client}                          : 172665456.000
producer-metrics:io-wait-ratio:{client-id=perf-producer-client}                             : 0.006
producer-metrics:io-wait-time-ns-avg:{client-id=perf-producer-client}                       : 28463.750
producer-metrics:io-wait-time-ns-total:{client-id=perf-producer-client}                     : 199587817.000
producer-metrics:metadata-age:{client-id=perf-producer-client}                              : 1.086
producer-metrics:metadata-wait-time-ns-total:{client-id=perf-producer-client}               : 277841715.000
producer-metrics:network-io-rate:{client-id=perf-producer-client}                           : 102.706
producer-metrics:network-io-total:{client-id=perf-producer-client}                          : 3200.000
producer-metrics:outgoing-byte-rate:{client-id=perf-producer-client}                        : 3534556.921
producer-metrics:outgoing-byte-total:{client-id=perf-producer-client}                       : 110126190.000
producer-metrics:produce-throttle-time-avg:{client-id=perf-producer-client}                 : 0.000
producer-metrics:produce-throttle-time-max:{client-id=perf-producer-client}                 : 0.000
producer-metrics:reauthentication-latency-avg:{client-id=perf-producer-client}              : NaN
producer-metrics:reauthentication-latency-max:{client-id=perf-producer-client}              : NaN
producer-metrics:record-error-rate:{client-id=perf-producer-client}                         : 0.000
producer-metrics:record-error-total:{client-id=perf-producer-client}                        : 0.000
producer-metrics:record-queue-time-avg:{client-id=perf-producer-client}                     : 1.123
producer-metrics:record-queue-time-max:{client-id=perf-producer-client}                     : 21.000
producer-metrics:record-retry-rate:{client-id=perf-producer-client}                         : 0.000
producer-metrics:record-retry-total:{client-id=perf-producer-client}                        : 0.000
producer-metrics:record-send-rate:{client-id=perf-producer-client}                          : 32211.306
producer-metrics:record-send-total:{client-id=perf-producer-client}                         : 1000000.000
producer-metrics:record-size-avg:{client-id=perf-producer-client}                           : 186.000
producer-metrics:record-size-max:{client-id=perf-producer-client}                           : 186.000
producer-metrics:records-per-request-avg:{client-id=perf-producer-client}                   : 636.132
producer-metrics:request-latency-avg:{client-id=perf-producer-client}                       : 1.935
producer-metrics:request-latency-max:{client-id=perf-producer-client}                       : 12.000
producer-metrics:request-rate:{client-id=perf-producer-client}                              : 50.583
producer-metrics:request-size-avg:{client-id=perf-producer-client}                          : 69877.024
producer-metrics:request-size-max:{client-id=perf-producer-client}                          : 163437.000
producer-metrics:request-total:{client-id=perf-producer-client}                             : 1576.000
producer-metrics:requests-in-flight:{client-id=perf-producer-client}                        : 0.000
producer-metrics:response-rate:{client-id=perf-producer-client}                             : 50.584
producer-metrics:response-total:{client-id=perf-producer-client}                            : 1576.000
producer-metrics:select-rate:{client-id=perf-producer-client}                               : 224.866
producer-metrics:select-total:{client-id=perf-producer-client}                              : 7012.000
producer-metrics:successful-authentication-no-reauth-total:{client-id=perf-producer-client} : 0.000
producer-metrics:successful-authentication-rate:{client-id=perf-producer-client}            : 0.000
producer-metrics:successful-authentication-total:{client-id=perf-producer-client}           : 0.000
producer-metrics:successful-reauthentication-rate:{client-id=perf-producer-client}          : 0.000
producer-metrics:successful-reauthentication-total:{client-id=perf-producer-client}         : 0.000
producer-metrics:txn-abort-time-ns-total:{client-id=perf-producer-client}                   : 0.000
producer-metrics:txn-begin-time-ns-total:{client-id=perf-producer-client}                   : 0.000
producer-metrics:txn-commit-time-ns-total:{client-id=perf-producer-client}                  : 0.000
producer-metrics:txn-init-time-ns-total:{client-id=perf-producer-client}                    : 0.000
producer-metrics:txn-prepare-time-ns-total:{client-id=perf-producer-client}                 : 0.000
producer-metrics:txn-send-offsets-time-ns-total:{client-id=perf-producer-client}            : 0.000
producer-metrics:waiting-threads:{client-id=perf-producer-client}                           : 0.000
producer-node-metrics:incoming-byte-rate:{client-id=perf-producer-client, node-id=node--1}  : 33.701
producer-node-metrics:incoming-byte-rate:{client-id=perf-producer-client, node-id=node-1}   : 5838.781
producer-node-metrics:incoming-byte-total:{client-id=perf-producer-client, node-id=node--1} : 1050.000
producer-node-metrics:incoming-byte-total:{client-id=perf-producer-client, node-id=node-1}  : 181300.000
producer-node-metrics:outgoing-byte-rate:{client-id=perf-producer-client, node-id=node--1}  : 5.681
producer-node-metrics:outgoing-byte-rate:{client-id=perf-producer-client, node-id=node-1}   : 3546617.275
producer-node-metrics:outgoing-byte-total:{client-id=perf-producer-client, node-id=node--1} : 177.000
producer-node-metrics:outgoing-byte-total:{client-id=perf-producer-client, node-id=node-1}  : 110126013.000
producer-node-metrics:request-latency-avg:{client-id=perf-producer-client, node-id=node--1} : NaN
producer-node-metrics:request-latency-avg:{client-id=perf-producer-client, node-id=node-1}  : 1.935
producer-node-metrics:request-latency-max:{client-id=perf-producer-client, node-id=node--1} : NaN
producer-node-metrics:request-latency-max:{client-id=perf-producer-client, node-id=node-1}  : 12.000
producer-node-metrics:request-rate:{client-id=perf-producer-client, node-id=node--1}        : 0.096
producer-node-metrics:request-rate:{client-id=perf-producer-client, node-id=node-1}         : 50.659
producer-node-metrics:request-size-avg:{client-id=perf-producer-client, node-id=node--1}    : 59.000
producer-node-metrics:request-size-avg:{client-id=perf-producer-client, node-id=node-1}     : 70010.180
producer-node-metrics:request-size-max:{client-id=perf-producer-client, node-id=node--1}    : 66.000
producer-node-metrics:request-size-max:{client-id=perf-producer-client, node-id=node-1}     : 163437.000
producer-node-metrics:request-total:{client-id=perf-producer-client, node-id=node--1}       : 3.000
producer-node-metrics:request-total:{client-id=perf-producer-client, node-id=node-1}        : 1573.000
producer-node-metrics:response-rate:{client-id=perf-producer-client, node-id=node--1}       : 0.096
producer-node-metrics:response-rate:{client-id=perf-producer-client, node-id=node-1}        : 50.659
producer-node-metrics:response-total:{client-id=perf-producer-client, node-id=node--1}      : 3.000
producer-node-metrics:response-total:{client-id=perf-producer-client, node-id=node-1}       : 1573.000
producer-topic-metrics:byte-rate:{client-id=perf-producer-client, topic=test-perf}          : 3543404.342
producer-topic-metrics:byte-total:{client-id=perf-producer-client, topic=test-perf}         : 109997901.000
producer-topic-metrics:compression-rate:{client-id=perf-producer-client, topic=test-perf}   : 1.000
producer-topic-metrics:record-error-rate:{client-id=perf-producer-client, topic=test-perf}  : 0.000
producer-topic-metrics:record-error-total:{client-id=perf-producer-client, topic=test-perf} : 0.000
producer-topic-metrics:record-retry-rate:{client-id=perf-producer-client, topic=test-perf}  : 0.000
producer-topic-metrics:record-retry-total:{client-id=perf-producer-client, topic=test-perf} : 0.000
producer-topic-metrics:record-send-rate:{client-id=perf-producer-client, topic=test-perf}   : 32213.381
producer-topic-metrics:record-send-total:{client-id=perf-producer-client, topic=test-perf}  : 1000000.000